Revit 2024 API
Surface Members
The Surface type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the Surface
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetBoundingBoxUV
 Gets the UV bounding box of the surface.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Project
 Project a 3D point orthogonally onto a surface (to find the nearest point). Throws InvalidOperationException if the projection fails.
ProjectWithGuessPoint
 Project a 3D point orthogonally onto a surface (to find the nearest point). This method is meant to be used when a good approximate solution for the projection is available. Throws InvalidOperationException if the projection fails.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
OrientationMatchesParametricOrientation
 Indicates whether this Surface's orientation is the same as or opposite to its parametric orientation.
See Also
Surface Class
Autodesk.Revit.DB Namespace